# Board games and Video games analysis

In this notebook we can observe the multiple queries that Luis Perez, current ToyStore Perez manager, 
uses to gain better understanding of board games nature, consumer preferences and some client recommendations.

## Importing libraries and establishing SQL Workbench connection

In [69]:
import pandas as pd
import pymysql
import sqlalchemy as alch
import os
from dotenv import load_dotenv
from getpass import getpass

In [70]:
board_games = pd.read_csv("./data/cleaned_board_games.csv")
video_games = pd.read_csv("./data/cleaned_video_games.csv")

In [72]:
##CORREGIR PARA NO TENER QUE PONER LA CONTRASEÑA
load_dotenv()

False

In [73]:
token = os.getenv("token")
token = getpass()

········

In [55]:
dbName = "games"
connectionData = f"mysql+pymysql://root:{token}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

#Adding/replacing the board games and the video games tables in the "games" database

board_games.to_sql("board_games", if_exists="replace", con=engine, index=False)
video_games.to_sql("video_games", if_exists="replace", con=engine, index=False)

16447

## Board games queries

#### 1. The first thing that Luis wants to know is the top 3 prefered games so they make sure they have them for the upcoming christmas season:

In [104]:
query = """SELECT name, category, WeightedAverage as Rating, users_rated FROM board_games
        ORDER BY Rating DESC
        Limit 3;"""

In [105]:
pd.read_sql_query(query, engine)

,name,category,Rating,users_rated
0,Pandemic Legacy: Season 1,"Environmental,Medical",8.604153,17251
1,Through the Ages: A New Story of Civilization,"Card Game,Civilization,Economic",8.582092,6888
2,Star Wars: Rebellion,"Dice,Fighting,Movies / TV / Radio theme,Scienc...",8.419264,8142

#### 2. Next, he gets corious about categories. He searches the top and last preferred categories by users:

In [99]:
query = """SELECT principal_category, AVG(WeightedAverage) AS Rating FROM board_games
        GROUP BY principal_category
        ORDER BY Rating DESC
        LIMIT 5;"""

In [100]:
pd.read_sql_query(query, engine)

  principal_category    Rating
0            Medical  6.850221
1       Civilization  6.805604
2      Environmental  6.780897
3        Renaissance  6.779208
4             Trains  6.740372

In [97]:
query = """SELECT principal_category, AVG(WeightedAverage) AS Rating FROM board_games
        GROUP BY principal_category
        ORDER BY Rating
        LIMIT 5;"""

In [98]:
pd.read_sql_query(query, engine)

  principal_category    Rating
0             Number  6.112652
1             Trivia  6.162238
2    Children's Game  6.198659
3   Video Game Theme  6.223877
4         Party Game  6.245198

Surprised by "Video Game Theme" category being one of the least preferred he wonders about what will be the preferred video game genres. He writes that down to research it on the video games analysis.

#### 3. One of the biggest differences Luis sees between board games and video games is the playing time. Driven by curiosity he analyzes the average playing time by categories.

In [88]:
query = """SELECT principal_category, avg((min_playtime + max_playtime)/2) as Average_playtime FROM board_games
        GROUP BY principal_category
        ORDER BY COUNT(principal_category) DESC
        LIMIT 5;"""

In [83]:
pd.read_sql_query(query, engine)

  principal_category  Average_playtime
0          Card Game         37.668033
1  Abstract Strategy         29.843427
2           Economic        133.349237
3          Adventure         75.896245
4           Bluffing         45.962926

#### 4. After checking the categories he wonders if games with expansions have a greater acceptance on the market:

In [106]:
query = """SELECT expansion, ROUND(AVG(WeightedAverage),2) as Rating, COUNT(expansion) as Count FROM board_games
GROUP BY expansion;"""

In [107]:
pd.read_sql_query(query, engine)

  expansion  Rating  Count
0        no    6.37   7392
1       yes    6.66   2663

Even though there is more than double games without exponsion users do value having expansions.

#### 5. Suddently a client enters the store and asks Luis for a recommendation. He has two daughters and is looking for a birthday present for the younger one that is turning 7. He explicitly asks that the game doesn't contain any war or fighting references.

In [108]:
query = """SELECT * FROM board_games
    WHERE min_players >= 2
        AND min_age < 10 
        AND min_playtime > 30
        AND max_playtime <= 60
        AND Year_of_Release > 2004
        AND "Children's Game" IN (principal_category, secondary_category)
        AND (principal_category NOT LIKE '%%Fighting%%' AND secondary_category NOT LIKE '%%Fighting%%' AND other_category NOT LIKE '%%Fighting%%')
        AND (principal_category NOT LIKE '%%Wargame%%' AND secondary_category NOT LIKE '%%Wargame%%' AND other_category NOT LIKE '%%Wargame%%')
        ORDER BY WeightedAverage DESC
        LIMIT 1;"""

In [109]:
pd.read_sql_query(query, engine)

,max_players,max_playtime,min_age,min_players,min_playtime,name,playing_time,Year_of_Release,artist,category,designer,expansion,publisher,average_rating,users_rated,principal_category,secondary_category,other_category,WeightedAverage
0,4,45,6,2,45,Voll in Fahrt,45,2010,Alexander Jung,"Children's Game,Racing,Trains",Bob Lindner,no,"AMIGO Spiel + Freizeit GmbH,Amo Oy,Asmodee,G3,...",6.50226,155,Children's Game,Racing,Trains,6.404641

## Video games queries

#### With the sight on the future of the company, he stars making himself questions about the video games industry... what has been the most sold videogame?

In [110]:
query = """SELECT name, Global_Sales, platform FROM video_games
 ORDER BY Global_Sales DESC
 LIMIT 5;"""

In [111]:
pd.read_sql_query(query, engine)

                       name  Global_Sales platform
0                Wii Sports         82.53      Wii
1         Super Mario Bros.         40.24      NES
2            Mario Kart Wii         35.52      Wii
3         Wii Sports Resort         32.77      Wii
4  Pokemon Red/Pokemon Blue         31.37       GB

Wasn't Wii Sports game included when buying the Wii console? Maybe that is why it is on the top sales... 
And Mario!!! His three child are crazy about Mario and Luigi... Is Europe the continent that love Mario's universe the most?

In [139]:
query = """SELECT ROUND(SUM(NA_Sales),2) as North_America ,
        ROUND(SUM(EU_Sales),2) as Europe,
        ROUND(SUM(JP_Sales),2) as Japan,
        ROUND(SUM(Other_Sales),2) as Other 
        FROM video_games
        WHERE Name LIKE '%%Mario%%';"""

In [140]:
pd.read_sql_query(query, engine)

   North_America  Europe   Japan  Other
0         277.26  130.98  116.34  29.93

Mario games seem to be more successful in North America by far... what about Pokemon games?

In [141]:
query = """SELECT ROUND(SUM(NA_Sales),2) as North_America ,
        ROUND(SUM(EU_Sales),2) as Europe,
        ROUND(SUM(JP_Sales),2) as Japan,
        ROUND(SUM(Other_Sales),2) as Other 
        FROM video_games
        WHERE Name LIKE '%%Pokemon%%';"""

In [142]:
pd.read_sql_query(query, engine)

   North_America  Europe  Japan  Other
0         101.82   63.08  79.94  12.43

In this case Japan has more Pokemon lovers than Europe! It would be interesting to visualize the differences across regions... Let's use Tableau to better understand the video games industry.